In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

1.3.4

In [3]:
# series de pandas:
# una serie es un array unidemensional que sera una columna, toma la siguiente forma
# pd.Series(array,index=array,dtype=None)
# array: es la lista que queremos poner en la columna
# index: hace referencia al indice de los valores que pasamos con el array
# dtype: es el typo de dato que queremos especificar de la serie (por defecto type=None)
# el dtype puede ser str, float, int
array = [1,2,3,4,5]
indice = ['a','b','c','d','e']
s = pd.Series(array,index=indice)
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
# para saber los valores que componen a mi serie usando .values
s.values
# notese que si no pongo el dtype en la formacion de la serie aca me permite saber de que tipo es

array([1, 2, 3, 4, 5], dtype=int64)

In [5]:
# puedo saber como esta compuesto el indice con .index (y su tipo de dato)
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [6]:
# accediendo a los elementos de mi serie por su posicion o por su indice
# por su posicion, en este caso la posicion 2 que seria el numero 3
s[2]

3

In [7]:
# accediendo al mismo valor pero ahora por su indice, es decir por 'c' daria el mismo numero 3
s['c']

3

In [8]:
# accediendo a un grupo de valores, primero por su posicion, es igual quqe slicing!
# si busco entre 1 y 3 dara los valores de la posicion 1 a la posicion 3 SIN LA ULTIMA!
s[1:3]

b    2
c    3
dtype: int64

In [9]:
# accediendo a un grupo de valores ahora por su indice, estos SI RESPENTAN DEL PRIMERO AL ULTIMO!
# por ejemplo si busco desde el indice "b" al indice "d" me trae esos 3 valores!
s['b':'d']

b    2
c    3
d    4
dtype: int64

In [10]:
# creacion de series a tarves de un diccionario
serie1 = pd.Series({'a':20,'b':45,'c':15})
serie1

a    20
b    45
c    15
dtype: int64

In [11]:
# saber como esta compuesto con .values
serie1.values

array([20, 45, 15], dtype=int64)

In [12]:
# saber como esta armado su indice con .index
serie1.index

Index(['a', 'b', 'c'], dtype='object')

In [13]:
# creando una nueva serie para futuros ejercicios
serie2 = pd.Series({'a':10,'b':11,'c':12})
serie2

a    10
b    11
c    12
dtype: int64

In [14]:
# dataframes en pandas:
# un dataframe es un arreglo bidimensional como una tabla donde los valores de las columnas 
# pueden ser de cualquier tipo, podremos armar un dataframe por ejemplo con varias series, recordando
# que una serie en pandas es un arreglo unidimensional como una columna

# creando un dataframe con valores de una serie

dataframe1 = pd.DataFrame({"Serie 1":serie1,"Serie 2":serie2})
dataframe1

   Serie 1  Serie 2
a       20       10
b       45       11
c       15       12

In [15]:
# podemos transponer un dataframe, es decir convertir las columnas en filas y viceversa
# usamos para eso el .T
# la operacion de transponer NO ES PERMANENTE! SOLO ES PARA VERLO, deberiamos guardarlo en una variable

dataframe1.T

          a   b   c
Serie 1  20  45  15
Serie 2  10  11  12

In [16]:
# mostrando los valores de mi dataframe con .values
dataframe1.values

array([[20, 10],
       [45, 11],
       [15, 12]], dtype=int64)

In [17]:
# podemos sacar valores de manera mas precisa indicando la posicion dentro del dataframe
# para este ejemplo quiero el valor de 45 que esta en la fila 1 y columna 0
dataframe1.values[1,0]

45

In [18]:
# mostrando el indice del dataframe
dataframe1.index

Index(['a', 'b', 'c'], dtype='object')

In [19]:
# podemos saber el nomnbre de las columnas de mi datafram con .columns
dataframe1.columns

Index(['Serie 1', 'Serie 2'], dtype='object')

In [20]:
# agregando columnas a un dataframe
# se le da un nombre de columna al dataframe y se le pasan valores con un array o una serie
# creando la columna "Serie 3" con los valores 50,51,52 en el dataframe1
dataframe1['Serie 3'] = [50,51,52]
dataframe1

   Serie 1  Serie 2  Serie 3
a       20       10       50
b       45       11       51
c       15       12       52

In [21]:
# podemos realizar operaciones entre las series (columnas) y al mismo tiempo crear una nueva columna!
# vamos a crear la columna "Suma 1 y 2" que suma los valores de la columna "Serie 1" y "Serie 2"
dataframe1['Suma 1 y 2'] = dataframe1['Serie 1'] + dataframe1['Serie 2']
dataframe1

   Serie 1  Serie 2  Serie 3  Suma 1 y 2
a       20       10       50          30
b       45       11       51          56
c       15       12       52          27

In [22]:
# podemos eliminar una columna utilizando del y especificando el nombre de la columna
# eliminando la columna 'Serie 3' del dataframe1
del dataframe1['Serie 3']
dataframe1

   Serie 1  Serie 2  Suma 1 y 2
a       20       10          30
b       45       11          56
c       15       12          27

In [23]:
# dentro de un dataframe tambien podemos hacer consultas o filtrar segun el valor que quiera
# vamos a filtrar con los valores de 'Serie' mayores a 15
data1 = dataframe1[dataframe1['Serie 1']>15]
data1

   Serie 1  Serie 2  Suma 1 y 2
a       20       10          30
b       45       11          56

In [24]:
# se puede complejizar haciendo consultas combinadas como por ejemplo:
# vamos a filtrar con los valores de 'Serie 1' mayores a 15 y 'Serie 2'<= 30
data2 = dataframe1[(dataframe1['Serie 1']>15) & (dataframe1['Serie 2']<=10)]
data2

   Serie 1  Serie 2  Suma 1 y 2
a       20       10          30

In [25]:
# podemos localizar filas con loc e iloc
# primero voy a llamar al dataframe asi lo veo mas cerca
dataframe1

   Serie 1  Serie 2  Suma 1 y 2
a       20       10          30
b       45       11          56
c       15       12          27

In [26]:
# usando loc le pasamos el nombre del indice que queremos, por ejemplo quiero el indice 'b'
dataframe1.loc['b']

Serie 1       45
Serie 2       11
Suma 1 y 2    56
Name: b, dtype: int64

In [27]:
# podemos usar loc tambien para llamar a los que quiero, por ejemplo a "a" y "c"

dataframe1.loc[['a','c']] #-> no me llama entre esos valores sino que me llama ESOS VALORES ESPECIFICOS!

   Serie 1  Serie 2  Suma 1 y 2
a       20       10          30
c       15       12          27

In [28]:
# inclusive podemos ser mas especificos pasando posicion de fila y de la columna
# para este ejemplo paso la fila "a" y la columna "Serie 2" para sacar el valor 10

dataframe1.loc['a','Serie 2']

10

In [29]:
# de esta forma tambien podriamos cambiar un valor si localizamos la posicion y asignamos un valor
# quiero asignar a la fila "b" de la columna "Serie 2" el valor de 22

dataframe1.loc['b','Serie 2'] = 22
dataframe1

   Serie 1  Serie 2  Suma 1 y 2
a       20       10          30
b       45       22          56
c       15       12          27

In [30]:
# usando iloc para ubicar un registro segun su posicion en las filas del dataframe
# por ejemplo, quiero saber los datos de la fila 1 que es de "a" 

dataframe1.iloc[1]

Serie 1       45
Serie 2       22
Suma 1 y 2    56
Name: b, dtype: int64

In [31]:
# con iloc SI PODEMOS TRAER UN GRUPO COMPRENDIDO ENTRE DOS VALORES!
# para este ejemplo traigo los valores desde la fila 0 a la fila 2 (la fila 2 NO INCLUIDA!)

dataframe1.iloc[0:2]

   Serie 1  Serie 2  Suma 1 y 2
a       20       10          30
b       45       22          56

In [32]:
# CREANDO UN DATAFRAME PARA EJERCICIO (nota: va a tener errores a proposito)

minutes = pd.Series([60,45,30,45,45,4500], index=[0,1,2,3,4,5])
rate = pd.Series([4,4,8,7,10], index=[0,1,3,4,5])
ask = pd.Series([1,'cero',2,2,3], index=[1,2,3,4,5])
dfClass = pd.DataFrame({'Minutos':minutes,'Rate':rate,'Ask':ask})
dfClass

   Minutos  Rate   Ask
0       60   4.0   NaN
1       45   4.0     1
2       30   NaN  cero
3       45   8.0     2
4       45   7.0     2
5     4500  10.0     3

In [33]:
# borrando los valores NAN del dataframe
# usamos el dropna(inplace=True), esta accion BORRA TODAS LAS FILAS QUE TENGAN NAN EN SUS VALORES! 
# el inplace=True aplica los cambios de manera PERMANENTE en el dataframe trabajado
# esta accion es valida si la proporcion borrada es menos del 5% (analizar segun caso)

nuevodfClass = dfClass.dropna() #-> no le puse inplace=True asi que e df original sigue igual
nuevodfClass

   Minutos  Rate Ask
1       45   4.0   1
3       45   8.0   2
4       45   7.0   2
5     4500  10.0   3

In [34]:
# en caso de no querer borrar esos valores NAN podemos reemplazarlos usando .fillna(valor,inplace=True)
# valor: es el valor que queremos poner en lugar de los NAN
# inplace=True:  aplica los cambios de manera PERMANENTE en el dataframe trabajado

# creando nuevamente el dataframe de trabajo primero
dfClass = pd.DataFrame({'Minutos':minutes,'Rate':rate,'Ask':ask})
dfClass

   Minutos  Rate   Ask
0       60   4.0   NaN
1       45   4.0     1
2       30   NaN  cero
3       45   8.0     2
4       45   7.0     2
5     4500  10.0     3

In [35]:
# aplicando un valor de 555 a los valores NAN de mi dataframe

dfClass.fillna(555,inplace=True) #-> aplico inplace=True para que quede PERMANENTE
dfClass

   Minutos   Rate   Ask
0       60    4.0   555
1       45    4.0     1
2       30  555.0  cero
3       45    8.0     2
4       45    7.0     2
5     4500   10.0     3

In [36]:
# podemos reemplazar los valores NAN de una columna en particular
# creando nuevamente el dataframe de trabajo primero

dfClass = pd.DataFrame({'Minutos':minutes,'Rate':rate,'Ask':ask})
dfClass

   Minutos  Rate   Ask
0       60   4.0   NaN
1       45   4.0     1
2       30   NaN  cero
3       45   8.0     2
4       45   7.0     2
5     4500  10.0     3

In [37]:
# con el dataframe de arriba, quiero cambiar los NAN de la columna 'Rate' por un valor de por ejemplo 5

dfClass['Rate'].fillna(5,inplace=True) #->aplico inplace=True
dfClass

   Minutos  Rate   Ask
0       60   4.0   NaN
1       45   4.0     1
2       30   5.0  cero
3       45   8.0     2
4       45   7.0     2
5     4500  10.0     3

In [38]:
# tambien podriamos cambiar los valores NAN de una columna (o de todo el dataframe) por una expresion
# como podria ser el promedio o la media o mediana de los valores que lo componen

# creando nuevamente el dataframe de trabajo primero
dfClass = pd.DataFrame({'Minutos':minutes,'Rate':rate,'Ask':ask})
dfClass

   Minutos  Rate   Ask
0       60   4.0   NaN
1       45   4.0     1
2       30   NaN  cero
3       45   8.0     2
4       45   7.0     2
5     4500  10.0     3

In [39]:
# podemos elegir expresiones para completar los datos faltantes como las siguientes:

# mean(): que seria la media o promedio de los valores
# median(): que seria el valor que se encuentra en el medio de los valores a analizar
# mode(): que seria la moda, o el valor que mas se repite

In [40]:
# calculando la media de la columna "Rate"
mean = dfClass['Rate'].mean()
mean

6.6

In [41]:
# calculando la mediana de la columna "Rate"
median = dfClass['Rate'].median()
median

7.0

In [42]:
# calculando la moda de la columna "Rate"
mode = dfClass['Rate'].mode()
mode

0    4.0
dtype: float64

In [43]:
# reemplazo los valores NAN de la columna 'Rate' con el promedio de la columna
mean = dfClass['Rate'].mean() # ya habia sido calculado y es que elijo para cambiar en los NAN
dfClass['Rate'].fillna(mean,inplace=True)
dfClass

   Minutos  Rate   Ask
0       60   4.0   NaN
1       45   4.0     1
2       30   6.6  cero
3       45   8.0     2
4       45   7.0     2
5     4500  10.0     3

In [44]:
# vamos a cambiar un valor que tiene mal el formato, el valor de "cero" en la columna "Ask"
# tenemos que hacer referencia a la columna y el valor a reemplazar
# en este caso reemplazo "cero" por el numero "0"

dfClass[dfClass['Ask']=='cero'] = 0
dfClass

   Minutos  Rate  Ask
0       60   4.0  NaN
1       45   4.0    1
2        0   0.0    0
3       45   8.0    2
4       45   7.0    2
5     4500  10.0    3